import React from "react";
import clsx from "clsx";
import "./svg.scss";

export default function (props) {

    const { theme, atThis } = props;

    return (
        <svg viewBox="0 0 14.01523 16.4249">
            <g id="f8e58d41-2d4f-4f69-8be3-b9d53ee08a44" data-name="图层 2">
                <g id="ad0714fe-83a4-4649-a4fd-7a2280b289bc" data-name="图层 1">
                    <path className={clsx("nemp-" + theme + "-appBar-button-svg", atThis === "workOrder" && theme + "-click-in-button")}
                        d="M11.657,1.19653h-.93923A1.18849,1.18849,0,0,0,9.52112,0H4.5124A1.18847,1.18847,0,0,0,3.31587,1.19653H2.35826a2.34643,2.34643,0,0,0-1.67445.68381A2.42063,2.42063,0,0,0,0,3.55479V14.06665A2.3626,2.3626,0,0,0,2.35826,16.4249h9.31523a2.38652,2.38652,0,0,0,2.34174-2.37656V3.553A2.3616,2.3616,0,0,0,11.657,1.19653Zm-7.31544,0a.17164.17164,0,0,1,.17087-.17087H9.50462a.16113.16113,0,0,1,.171.17087V2.76994a.16116.16116,0,0,1-.171.171H4.5124a.16113.16113,0,0,1-.17087-.171Zm7.31732,14.1881H2.35826A1.33355,1.33355,0,0,1,1.02566,14.052V3.55667a1.33355,1.33355,0,0,1,1.3326-1.33259h.95761v.54774A1.18847,1.18847,0,0,0,4.5124,3.96835H9.50462a1.18855,1.18855,0,0,0,1.19663-1.19653V2.22408h.941a1.32415,1.32415,0,0,1,1.33259,1.33259V14.052h.01659A1.33476,1.33476,0,0,1,11.65885,15.38463Z" />
                    <path className={clsx("nemp-" + theme + "-appBar-button-svg", atThis === "workOrder" && theme + "-click-in-button")}
                        d="M9.74352,5.641h-5.47a.51282.51282,0,1,0,0,1.02564h5.47a.51282.51282,0,0,0,0-1.02564Z" />
                    <path className={clsx("nemp-" + theme + "-appBar-button-svg", atThis === "workOrder" && theme + "-click-in-button")}
                        d="M9.74352,8.376h-5.47a.51282.51282,0,1,0,0,1.02564h5.47a.51282.51282,0,0,0,0-1.02564Z" />
                    <path className={clsx("nemp-" + theme + "-appBar-button-svg", atThis === "workOrder" && theme + "-click-in-button")}
                        d="M9.74352,11.11113h-5.47a.51278.51278,0,1,0,0,1.02555h5.47a.51278.51278,0,1,0,0-1.02555Z" />
                </g>
            </g>
        </svg>
    );
}